examples/flows/compiled/decorator_definitions/flow.mmd
flowchart TD
    %% Flow: decorator_definitions_flow

    end_decorator_definitions_flow([end_decorator_definitions_flow])
    enrich[enrich]
    router_decorator_definitions_flow_line_27_seq_1{{router_decorator_definitions_flow_line_27_seq_1}}
    start_decorator_definitions_flow([start_decorator_definitions_flow])
    validate[validate]

    start_decorator_definitions_flow --> router_decorator_definitions_flow_line_27_seq_1
    router_decorator_definitions_flow_line_27_seq_1 --> validate
    router_decorator_definitions_flow_line_27_seq_1 --> enrich
